In [1]:
import pandas as pd
import numpy as np

In [2]:
dic1 = {
    "name": ['harry', 'rohan', 'skilf', 'shubh'],
    "marks": [89, 78, 56, 25],
    "city": ['rampur', 'chowk', 'gkp', 'nursay']
}

In [3]:
df = pd.DataFrame(dic1)

In [4]:
df

    name  marks    city
0  harry     89  rampur
1  rohan     78   chowk
2  skilf     56     gkp
3  shubh     25  nursay

# making csv file

In [8]:
df.to_csv("friend.csv")